ProgessBase/Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПодразделения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициент</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРФ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриториальныеУсловияПФР</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриториальныеУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AVT_ЦентрУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AVT_ЦентрУчетаЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AVT_ИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетСудамПодФлагомРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГДивизион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГДивизионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГДопОфис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГДопОфисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГЭтоБухЗатраты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГ_ЦентрУчетаЗатрат2014</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_ЦентрыУчетаЗатрат2014</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГ_СтарыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЛинии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСолво</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/InformationRegisters/ПРГ_СоответствиеПодразделенийЗатратИПодразделенийКадровогоУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПРГ_СоответствиеПодразделенийЗатратИПодразделенийКадровогоУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодразделениеЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКадровогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/Catalogs/ПодразделенияОрганизаций/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем КонтролироватьПорядок Экспорт;

Перем ПрошлыйИзмененныйРодительОбъектаДоступа;

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура, обработчик события "ПередЗаписью" объекта
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПрошлыйИзмененныйРодительОбъектаДоступа = ?(Не ЭтоНовый() и Не Ссылка.Родитель = Родитель, Ссылка.Родитель, Неопределено);
	НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель);
	
	Если НЕ Отказ Тогда
		ОбщегоНазначенияЗК.ПередЗаписьюОбъектаПорядка(Отказ, ЭтотОбъект, КонтролироватьПорядок);
	КонецЕсли;
	
	//начало изменений БП 07 
	ПРГЭтоБухЗатраты = ОпределитьЧтоЗаПодразделение();
	//конец изменений БП 07	 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаПравДоступа.ОбновитьПраваДоступаКИерархическимОбъектамПриНеобходимости(Ссылка, ПрошлыйИзмененныйРодительОбъектаДоступа, Отказ);
	
	//начало изменений БП 07 
	Если ПРГЭтоБухЗатраты Тогда
		 РегСоотв = РегистрыСведений.ПРГ_СоответствиеПодразделенийЗатратИПодразделенийКадровогоУчета.СоздатьНаборЗаписей();
		 РегСоотв.Отбор.ПодразделениеКадровогоУчета.Значение 	 = Ссылка;
		 РегСоотв.Отбор.ПодразделениеКадровогоУчета.Использование = Истина;
		 РегСоотв.Прочитать();
		 Если РегСоотв.Количество() > 0 Тогда
			 РегСоотв.Очистить();
			 РегСоотв.Записать();
		 КонецЕсли;	 
	 КонецЕсли;		
	//конец изменений БП 07	 
	
КонецПроцедуры

//начало изменений БП 07 
Функция ОпределитьЧтоЗаПодразделение() Экспорт 
	Результат = ПРГЭтоБухЗатраты; 
	Если Уровень() > 0 Тогда // определим что это за подразделение
	    ТекРод = Родитель;
		Пока ТекРод.Уровень() > 0 Цикл
			ТекРод = ТекРод.Родитель;
		КонецЦикла;
		Результат  = ТекРод.ПРГЭтоБухЗатраты;
	КонецЕсли;	
    возврат Результат;
КонецФункции	
//конец изменений БП 07	 


////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ


КонтролироватьПорядок = Истина;
